; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-24)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city1)
	(fuel-level plane1 fl5)
	(at plane2 city1)
	(fuel-level plane2 fl2)
	(at plane3 city0)
	(fuel-level plane3 fl3)
	(at plane4 city0)
	(fuel-level plane4 fl1)
	(at plane5 city1)
	(fuel-level plane5 fl3)
	(at plane6 city1)
	(fuel-level plane6 fl6)
	(at person1 city0)
	(at person2 city0)
	(at person3 city2)
	(at person4 city0)
	(at person5 city0)
	(at person6 city3)
	(at person7 city3)
	(at person8 city3)
	(at person9 city1)
	(at person10 city0)
	(at person11 city1)
	(at person12 city0)
	(at person13 city1)
	(at person14 city2)
	(at person15 city3)
	(at person16 city3)
	(at person17 city0)
	(at person18 city2)
	(at person19 city1)
	(at person20 city0)
	(at person21 city0)
	(at person22 city1)
	(at person23 city2)
	(at person24 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city1)
	(at plane5 city2)
	(at person1 city1)
	(at person2 city0)
	(at person3 city1)
	(at person4 city3)
	(at person5 city2)
	(at person6 city3)
	(at person7 city3)
	(at person8 city1)
	(at person9 city3)
	(at person10 city3)
	(at person11 city3)
	(at person12 city0)
	(at person13 city2)
	(at person14 city3)
	(at person15 city3)
	(at person16 city3)
	(at person17 city2)
	(at person18 city1)
	(at person19 city3)
	(at person20 city0)
	(at person22 city2)
	(at person23 city0)
	(at person24 city2)
	))

)

; plan
1. (zoom plane5 city1 city2 fl3 fl2 fl1)
   deleted: (at plane5 city1) (fuel-level plane5 fl3)
   added: (at plane5 city2) (fuel-level plane5 fl1)
   goals met: 9 of 25
2. (board person3 plane5 city2)
   deleted: (at person3 city2)
   added: (in person3 plane5)
   goals met: 9 of 25
3. (board person23 plane5 city2)
   deleted: (at person23 city2)
   added: (in person23 plane5)
   goals met: 9 of 25
4. (board person18 plane5 city2)
   deleted: (at person18 city2)
   added: (in person18 plane5)
   goals met: 9 of 25
5. (board person14 plane5 city2)
   deleted: (at person14 city2)
   added: (in person14 plane5)
   goals met: 9 of 25
6. (board person10 plane4 city0)
   deleted: (at person10 city0)
   added: (in person10 plane4)
   goals met: 9 of 25
7. (fly plane4 city0 city3 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city3) (fuel-level plane4 fl0)
   goals met: 9 of 25
8. (board person8 plane4 city3)
   deleted: (at person8 city3)
   added: (in person8 plane4)
   goals met: 9 of 25
9. (refuel plane4 city3 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 9 of 25
10. (debark person10 plane4 city3)
   deleted: (in person10 plane4)
   added: (at person10 city3)
   goals met: 10 of 25
11. (fly plane4 city3 city1 fl1 fl0)
   deleted: (at plane4 city3) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 10 of 25
12. (debark person8 plane4 city1)
   deleted: (in person8 plane4)
   added: (at person8 city1)
   goals met: 11 of 25
13. (board person5 plane3 city0)
   deleted: (at person5 city0)
   added: (in person5 plane3)
   goals met: 11 of 25
14. (board person4 plane3 city0)
   deleted: (at person4 city0)
   added: (in person4 plane3)
   goals met: 11 of 25
15. (board person17 plane3 city0)
   deleted: (at person17 city0)
   added: (in person17 plane3)
   goals met: 11 of 25
16. (zoom plane3 city0 city2 fl3 fl2 fl1)
   deleted: (at plane3 city0) (fuel-level plane3 fl3)
   added: (at plane3 city2) (fuel-level plane3 fl1)
   goals met: 11 of 25
17. (debark person5 plane3 city2)
   deleted: (in person5 plane3)
   added: (at person5 city2)
   goals met: 12 of 25
18. (debark person17 plane3 city2)
   deleted: (in person17 plane3)
   added: (at person17 city2)
   goals met: 13 of 25
19. (fly plane3 city2 city3 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 13 of 25
20. (debark person4 plane3 city3)
   deleted: (in person4 plane3)
   added: (at person4 city3)
   goals met: 14 of 25
21. (zoom plane1 city1 city0 fl5 fl4 fl3)
   deleted: (at plane1 city1) (fuel-level plane1 fl5)
   added: (at plane1 city0) (fuel-level plane1 fl3)
   goals met: 14 of 25
22. (board person9 plane2 city1)
   deleted: (at person9 city1)
   added: (in person9 plane2)
   goals met: 14 of 25
23. (board person24 plane2 city1)
   deleted: (at person24 city1)
   added: (in person24 plane2)
   goals met: 14 of 25
24. (board person22 plane2 city1)
   deleted: (at person22 city1)
   added: (in person22 plane2)
   goals met: 14 of 25
25. (board person19 plane2 city1)
   deleted: (at person19 city1)
   added: (in person19 plane2)
   goals met: 14 of 25
26. (board person13 plane2 city1)
   deleted: (at person13 city1)
   added: (in person13 plane2)
   goals met: 14 of 25
27. (board person11 plane2 city1)
   deleted: (at person11 city1)
   added: (in person11 plane2)
   goals met: 14 of 25
28. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   goals met: 14 of 25
29. (zoom plane1 city0 city1 fl3 fl2 fl1)
   deleted: (at plane1 city0) (fuel-level plane1 fl3)
   added: (at plane1 city1) (fuel-level plane1 fl1)
   goals met: 14 of 25
30. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   goals met: 15 of 25
31. (fly plane5 city2 city1 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 14 of 25
32. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 14 of 25
33. (debark person3 plane5 city1)
   deleted: (in person3 plane5)
   added: (at person3 city1)
   goals met: 15 of 25
34. (debark person18 plane5 city1)
   deleted: (in person18 plane5)
   added: (at person18 city1)
   goals met: 16 of 25
35. (fly plane5 city1 city0 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city0) (fuel-level plane5 fl0)
   goals met: 16 of 25
36. (refuel plane5 city0 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 25
37. (debark person23 plane5 city0)
   deleted: (in person23 plane5)
   added: (at person23 city0)
   goals met: 17 of 25
38. (fly plane5 city0 city3 fl1 fl0)
   deleted: (at plane5 city0) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 17 of 25
39. (refuel plane5 city3 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 17 of 25
40. (debark person14 plane5 city3)
   deleted: (in person14 plane5)
   added: (at person14 city3)
   goals met: 18 of 25
41. (fly plane5 city3 city2 fl1 fl0)
   deleted: (at plane5 city3) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 19 of 25
42. (zoom plane2 city1 city2 fl2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl2)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 18 of 25
43. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 18 of 25
44. (debark person24 plane2 city2)
   deleted: (in person24 plane2)
   added: (at person24 city2)
   goals met: 19 of 25
45. (debark person22 plane2 city2)
   deleted: (in person22 plane2)
   added: (at person22 city2)
   goals met: 20 of 25
46. (debark person13 plane2 city2)
   deleted: (in person13 plane2)
   added: (at person13 city2)
   goals met: 21 of 25
47. (fly plane2 city2 city3 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 21 of 25
48. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 21 of 25
49. (debark person9 plane2 city3)
   deleted: (in person9 plane2)
   added: (at person9 city3)
   goals met: 22 of 25
50. (debark person19 plane2 city3)
   deleted: (in person19 plane2)
   added: (at person19 city3)
   goals met: 23 of 25
51. (debark person11 plane2 city3)
   deleted: (in person11 plane2)
   added: (at person11 city3)
   goals met: 24 of 25
52. (fly plane2 city3 city1 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city1) (fuel-level plane2 fl0)
   goals met: 25 of 25
